# GetNumRoofElements

## Description
Function GetNumRoofElements returns the number of roof elements (dormers and skylights) in the referenced roof object.

```pascal
FUNCTION GetNumRoofElements(roofObject : HANDLE) : INTEGER;
```

```python

def vs.GetNumRoofElements(roofObject):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|roofObject|HANDLE|Handle to roof.|

## Version
Availability: from VectorWorks8.0
## Category
* Objects - Roofs